SiliconLabs/Gecko_SDK_discontinued/platform/Device/SiliconLabs/EFR32MG2P/Include/efr32mg2p_cmu.h
/* Bit fields for CMU HFPERCLKEN0 */
#define _CMU_HFPERCLKEN0_RESETVALUE                       0x00000000UL                               /**< Default value for CMU_HFPERCLKEN0 */
#define _CMU_HFPERCLKEN0_MASK                             0x0003FFFFUL                               /**< Mask for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TIMER0                            (0x1UL << 0)                               /**< Timer 0 Clock Enable */
#define _CMU_HFPERCLKEN0_TIMER0_SHIFT                     0                                          /**< Shift value for CMU_TIMER0 */
#define _CMU_HFPERCLKEN0_TIMER0_MASK                      0x1UL                                      /**< Bit mask for CMU_TIMER0 */
#define _CMU_HFPERCLKEN0_TIMER0_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TIMER0_DEFAULT                    (_CMU_HFPERCLKEN0_TIMER0_DEFAULT << 0)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TIMER1                            (0x1UL << 1)                               /**< Timer 1 Clock Enable */
#define _CMU_HFPERCLKEN0_TIMER1_SHIFT                     1                                          /**< Shift value for CMU_TIMER1 */
#define _CMU_HFPERCLKEN0_TIMER1_MASK                      0x2UL                                      /**< Bit mask for CMU_TIMER1 */
#define _CMU_HFPERCLKEN0_TIMER1_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TIMER1_DEFAULT                    (_CMU_HFPERCLKEN0_TIMER1_DEFAULT << 1)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_WTIMER0                           (0x1UL << 2)                               /**< Wide Timer 0 Clock Enable */
#define _CMU_HFPERCLKEN0_WTIMER0_SHIFT                    2                                          /**< Shift value for CMU_WTIMER0 */
#define _CMU_HFPERCLKEN0_WTIMER0_MASK                     0x4UL                                      /**< Bit mask for CMU_WTIMER0 */
#define _CMU_HFPERCLKEN0_WTIMER0_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_WTIMER0_DEFAULT                   (_CMU_HFPERCLKEN0_WTIMER0_DEFAULT << 2)    /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_WTIMER1                           (0x1UL << 3)                               /**< Wide Timer 1 Clock Enable */
#define _CMU_HFPERCLKEN0_WTIMER1_SHIFT                    3                                          /**< Shift value for CMU_WTIMER1 */
#define _CMU_HFPERCLKEN0_WTIMER1_MASK                     0x8UL                                      /**< Bit mask for CMU_WTIMER1 */
#define _CMU_HFPERCLKEN0_WTIMER1_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_WTIMER1_DEFAULT                   (_CMU_HFPERCLKEN0_WTIMER1_DEFAULT << 3)    /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART0                            (0x1UL << 4)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 0 Clock Enable */
#define _CMU_HFPERCLKEN0_USART0_SHIFT                     4                                          /**< Shift value for CMU_USART0 */
#define _CMU_HFPERCLKEN0_USART0_MASK                      0x10UL                                     /**< Bit mask for CMU_USART0 */
#define _CMU_HFPERCLKEN0_USART0_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART0_DEFAULT                    (_CMU_HFPERCLKEN0_USART0_DEFAULT << 4)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART1                            (0x1UL << 5)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 1 Clock Enable */
#define _CMU_HFPERCLKEN0_USART1_SHIFT                     5                                          /**< Shift value for CMU_USART1 */
#define _CMU_HFPERCLKEN0_USART1_MASK                      0x20UL                                     /**< Bit mask for CMU_USART1 */
#define _CMU_HFPERCLKEN0_USART1_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART1_DEFAULT                    (_CMU_HFPERCLKEN0_USART1_DEFAULT << 5)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART2                            (0x1UL << 6)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 2 Clock Enable */
#define _CMU_HFPERCLKEN0_USART2_SHIFT                     6                                          /**< Shift value for CMU_USART2 */
#define _CMU_HFPERCLKEN0_USART2_MASK                      0x40UL                                     /**< Bit mask for CMU_USART2 */
#define _CMU_HFPERCLKEN0_USART2_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART2_DEFAULT                    (_CMU_HFPERCLKEN0_USART2_DEFAULT << 6)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART3                            (0x1UL << 7)                               /**< Universal Synchronous/Asynchronous Receiver/Transmitter 3 Clock Enable */
#define _CMU_HFPERCLKEN0_USART3_SHIFT                     7                                          /**< Shift value for CMU_USART3 */
#define _CMU_HFPERCLKEN0_USART3_MASK                      0x80UL                                     /**< Bit mask for CMU_USART3 */
#define _CMU_HFPERCLKEN0_USART3_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_USART3_DEFAULT                    (_CMU_HFPERCLKEN0_USART3_DEFAULT << 7)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_I2C0                              (0x1UL << 8)                               /**< I2C 0 Clock Enable */
#define _CMU_HFPERCLKEN0_I2C0_SHIFT                       8                                          /**< Shift value for CMU_I2C0 */
#define _CMU_HFPERCLKEN0_I2C0_MASK                        0x100UL                                    /**< Bit mask for CMU_I2C0 */
#define _CMU_HFPERCLKEN0_I2C0_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_I2C0_DEFAULT                      (_CMU_HFPERCLKEN0_I2C0_DEFAULT << 8)       /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_I2C1                              (0x1UL << 9)                               /**< I2C 1 Clock Enable */
#define _CMU_HFPERCLKEN0_I2C1_SHIFT                       9                                          /**< Shift value for CMU_I2C1 */
#define _CMU_HFPERCLKEN0_I2C1_MASK                        0x200UL                                    /**< Bit mask for CMU_I2C1 */
#define _CMU_HFPERCLKEN0_I2C1_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_I2C1_DEFAULT                      (_CMU_HFPERCLKEN0_I2C1_DEFAULT << 9)       /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_ACMP0                             (0x1UL << 10)                              /**< Analog Comparator 0 Clock Enable */
#define _CMU_HFPERCLKEN0_ACMP0_SHIFT                      10                                         /**< Shift value for CMU_ACMP0 */
#define _CMU_HFPERCLKEN0_ACMP0_MASK                       0x400UL                                    /**< Bit mask for CMU_ACMP0 */
#define _CMU_HFPERCLKEN0_ACMP0_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_ACMP0_DEFAULT                     (_CMU_HFPERCLKEN0_ACMP0_DEFAULT << 10)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_ACMP1                             (0x1UL << 11)                              /**< Analog Comparator 1 Clock Enable */
#define _CMU_HFPERCLKEN0_ACMP1_SHIFT                      11                                         /**< Shift value for CMU_ACMP1 */
#define _CMU_HFPERCLKEN0_ACMP1_MASK                       0x800UL                                    /**< Bit mask for CMU_ACMP1 */
#define _CMU_HFPERCLKEN0_ACMP1_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_ACMP1_DEFAULT                     (_CMU_HFPERCLKEN0_ACMP1_DEFAULT << 11)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_CRYOTIMER                         (0x1UL << 12)                              /**< CryoTimer Clock Enable */
#define _CMU_HFPERCLKEN0_CRYOTIMER_SHIFT                  12                                         /**< Shift value for CMU_CRYOTIMER */
#define _CMU_HFPERCLKEN0_CRYOTIMER_MASK                   0x1000UL                                   /**< Bit mask for CMU_CRYOTIMER */
#define _CMU_HFPERCLKEN0_CRYOTIMER_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_CRYOTIMER_DEFAULT                 (_CMU_HFPERCLKEN0_CRYOTIMER_DEFAULT << 12) /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_ADC0                              (0x1UL << 13)                              /**< Analog to Digital Converter 0 Clock Enable */
#define _CMU_HFPERCLKEN0_ADC0_SHIFT                       13                                         /**< Shift value for CMU_ADC0 */
#define _CMU_HFPERCLKEN0_ADC0_MASK                        0x2000UL                                   /**< Bit mask for CMU_ADC0 */
#define _CMU_HFPERCLKEN0_ADC0_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_ADC0_DEFAULT                      (_CMU_HFPERCLKEN0_ADC0_DEFAULT << 13)      /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_IDAC0                             (0x1UL << 14)                              /**< Current Digital to Analog Converter 0 Clock Enable */
#define _CMU_HFPERCLKEN0_IDAC0_SHIFT                      14                                         /**< Shift value for CMU_IDAC0 */
#define _CMU_HFPERCLKEN0_IDAC0_MASK                       0x4000UL                                   /**< Bit mask for CMU_IDAC0 */
#define _CMU_HFPERCLKEN0_IDAC0_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_IDAC0_DEFAULT                     (_CMU_HFPERCLKEN0_IDAC0_DEFAULT << 14)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_VDAC0                             (0x1UL << 15)                              /**< Digital to Analog Converter 0 Clock Enable */
#define _CMU_HFPERCLKEN0_VDAC0_SHIFT                      15                                         /**< Shift value for CMU_VDAC0 */
#define _CMU_HFPERCLKEN0_VDAC0_MASK                       0x8000UL                                   /**< Bit mask for CMU_VDAC0 */
#define _CMU_HFPERCLKEN0_VDAC0_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_VDAC0_DEFAULT                     (_CMU_HFPERCLKEN0_VDAC0_DEFAULT << 15)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_CSEN                              (0x1UL << 16)                              /**< Capacitive touch sense module Clock Enable */
#define _CMU_HFPERCLKEN0_CSEN_SHIFT                       16                                         /**< Shift value for CMU_CSEN */
#define _CMU_HFPERCLKEN0_CSEN_MASK                        0x10000UL                                  /**< Bit mask for CMU_CSEN */
#define _CMU_HFPERCLKEN0_CSEN_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_CSEN_DEFAULT                      (_CMU_HFPERCLKEN0_CSEN_DEFAULT << 16)      /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TRNG0                             (0x1UL << 17)                              /**< True Random Number Generator 0 Clock Enable */
#define _CMU_HFPERCLKEN0_TRNG0_SHIFT                      17                                         /**< Shift value for CMU_TRNG0 */
#define _CMU_HFPERCLKEN0_TRNG0_MASK                       0x20000UL                                  /**< Bit mask for CMU_TRNG0 */
#define _CMU_HFPERCLKEN0_TRNG0_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFPERCLKEN0 */
#define CMU_HFPERCLKEN0_TRNG0_DEFAULT                     (_CMU_HFPERCLKEN0_TRNG0_DEFAULT << 17)     /**< Shifted mode DEFAULT for CMU_HFPERCLKEN0 */

/* Bit fields for CMU HFRADIOCLKEN0 */
#define _CMU_HFRADIOCLKEN0_RESETVALUE                     0x00000000UL                               /**< Default value for CMU_HFRADIOCLKEN0 */
#define _CMU_HFRADIOCLKEN0_MASK                           0x000000FFUL                               /**< Mask for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_PROTIMER                        (0x1UL << 0)                               /**< Protocol Timer Clock Enable */
#define _CMU_HFRADIOCLKEN0_PROTIMER_SHIFT                 0                                          /**< Shift value for CMU_PROTIMER */
#define _CMU_HFRADIOCLKEN0_PROTIMER_MASK                  0x1UL                                      /**< Bit mask for CMU_PROTIMER */
#define _CMU_HFRADIOCLKEN0_PROTIMER_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_PROTIMER_DEFAULT                (_CMU_HFRADIOCLKEN0_PROTIMER_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_RFSENSE                         (0x1UL << 1)                               /**< RF Sense Clock Enable */
#define _CMU_HFRADIOCLKEN0_RFSENSE_SHIFT                  1                                          /**< Shift value for CMU_RFSENSE */
#define _CMU_HFRADIOCLKEN0_RFSENSE_MASK                   0x2UL                                      /**< Bit mask for CMU_RFSENSE */
#define _CMU_HFRADIOCLKEN0_RFSENSE_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_RFSENSE_DEFAULT                 (_CMU_HFRADIOCLKEN0_RFSENSE_DEFAULT << 1)  /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_RAC                             (0x1UL << 2)                               /**< Radio Controller Clock Enable */
#define _CMU_HFRADIOCLKEN0_RAC_SHIFT                      2                                          /**< Shift value for CMU_RAC */
#define _CMU_HFRADIOCLKEN0_RAC_MASK                       0x4UL                                      /**< Bit mask for CMU_RAC */
#define _CMU_HFRADIOCLKEN0_RAC_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_RAC_DEFAULT                     (_CMU_HFRADIOCLKEN0_RAC_DEFAULT << 2)      /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_FRC                             (0x1UL << 3)                               /**< Frame Controller Clock Enable */
#define _CMU_HFRADIOCLKEN0_FRC_SHIFT                      3                                          /**< Shift value for CMU_FRC */
#define _CMU_HFRADIOCLKEN0_FRC_MASK                       0x8UL                                      /**< Bit mask for CMU_FRC */
#define _CMU_HFRADIOCLKEN0_FRC_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_FRC_DEFAULT                     (_CMU_HFRADIOCLKEN0_FRC_DEFAULT << 3)      /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_CRC                             (0x1UL << 4)                               /**< Cyclic Redundancy Check Clock Enable */
#define _CMU_HFRADIOCLKEN0_CRC_SHIFT                      4                                          /**< Shift value for CMU_CRC */
#define _CMU_HFRADIOCLKEN0_CRC_MASK                       0x10UL                                     /**< Bit mask for CMU_CRC */
#define _CMU_HFRADIOCLKEN0_CRC_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_CRC_DEFAULT                     (_CMU_HFRADIOCLKEN0_CRC_DEFAULT << 4)      /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_SYNTH                           (0x1UL << 5)                               /**< Frequency Synthesizer Clock Enable */
#define _CMU_HFRADIOCLKEN0_SYNTH_SHIFT                    5                                          /**< Shift value for CMU_SYNTH */
#define _CMU_HFRADIOCLKEN0_SYNTH_MASK                     0x20UL                                     /**< Bit mask for CMU_SYNTH */
#define _CMU_HFRADIOCLKEN0_SYNTH_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_SYNTH_DEFAULT                   (_CMU_HFRADIOCLKEN0_SYNTH_DEFAULT << 5)    /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_MODEM                           (0x1UL << 6)                               /**< Modulator / demodulator Clock Enable */
#define _CMU_HFRADIOCLKEN0_MODEM_SHIFT                    6                                          /**< Shift value for CMU_MODEM */
#define _CMU_HFRADIOCLKEN0_MODEM_MASK                     0x40UL                                     /**< Bit mask for CMU_MODEM */
#define _CMU_HFRADIOCLKEN0_MODEM_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_MODEM_DEFAULT                   (_CMU_HFRADIOCLKEN0_MODEM_DEFAULT << 6)    /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_AGC                             (0x1UL << 7)                               /**< Automatic Gain Control Clock Enable */
#define _CMU_HFRADIOCLKEN0_AGC_SHIFT                      7                                          /**< Shift value for CMU_AGC */
#define _CMU_HFRADIOCLKEN0_AGC_MASK                       0x80UL                                     /**< Bit mask for CMU_AGC */
#define _CMU_HFRADIOCLKEN0_AGC_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for CMU_HFRADIOCLKEN0 */
#define CMU_HFRADIOCLKEN0_AGC_DEFAULT                     (_CMU_HFRADIOCLKEN0_AGC_DEFAULT << 7)      /**< Shifted mode DEFAULT for CMU_HFRADIOCLKEN0 */

/* Bit fields for CMU HFRADIOALTCLKEN0 */
#define _CMU_HFRADIOALTCLKEN0_RESETVALUE                  0x00000000UL                              /**< Default value for CMU_HFRADIOALTCLKEN0 */
#define _CMU_HFRADIOALTCLKEN0_MASK                        0x00000001UL                              /**< Mask for CMU_HFRADIOALTCLKEN0 */
#define CMU_HFRADIOALTCLKEN0_BUFC                         (0x1UL << 0)                              /**< Buffer Controller Clock Enable */
#define _CMU_HFRADIOALTCLKEN0_BUFC_SHIFT                  0                                         /**< Shift value for CMU_BUFC */
#define _CMU_HFRADIOALTCLKEN0_BUFC_MASK                   0x1UL                                     /**< Bit mask for CMU_BUFC */
#define _CMU_HFRADIOALTCLKEN0_BUFC_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for CMU_HFRADIOALTCLKEN0 */
#define CMU_HFRADIOALTCLKEN0_BUFC_DEFAULT                 (_CMU_HFRADIOALTCLKEN0_BUFC_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_HFRADIOALTCLKEN0 */

/* Bit fields for CMU LFACLKEN0 */
#define _CMU_LFACLKEN0_RESETVALUE                         0x00000000UL                           /**< Default value for CMU_LFACLKEN0 */
#define _CMU_LFACLKEN0_MASK                               0x00000003UL                           /**< Mask for CMU_LFACLKEN0 */
#define CMU_LFACLKEN0_LETIMER0                            (0x1UL << 0)                           /**< Low Energy Timer 0 Clock Enable */
#define _CMU_LFACLKEN0_LETIMER0_SHIFT                     0                                      /**< Shift value for CMU_LETIMER0 */
#define _CMU_LFACLKEN0_LETIMER0_MASK                      0x1UL                                  /**< Bit mask for CMU_LETIMER0 */
#define _CMU_LFACLKEN0_LETIMER0_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for CMU_LFACLKEN0 */
#define CMU_LFACLKEN0_LETIMER0_DEFAULT                    (_CMU_LFACLKEN0_LETIMER0_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_LFACLKEN0 */
#define CMU_LFACLKEN0_LESENSE                             (0x1UL << 1)                           /**< Low Energy Sensor Interface Clock Enable */
#define _CMU_LFACLKEN0_LESENSE_SHIFT                      1                                      /**< Shift value for CMU_LESENSE */
#define _CMU_LFACLKEN0_LESENSE_MASK                       0x2UL                                  /**< Bit mask for CMU_LESENSE */
#define _CMU_LFACLKEN0_LESENSE_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for CMU_LFACLKEN0 */
#define CMU_LFACLKEN0_LESENSE_DEFAULT                     (_CMU_LFACLKEN0_LESENSE_DEFAULT << 1)  /**< Shifted mode DEFAULT for CMU_LFACLKEN0 */

